blog/nixos-1.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NixOS: the first month in</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="/images/favicon.png">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Lora:ital,wght@0,400;0,600;1,400&display=swap" rel="stylesheet">
<link rel="stylesheet" href="../blog.css">
</head>
<body>
<div id="content" class="content">
<div class="page-wrap">
<a href="../blog.html" class="back">← all posts</a>
<header class="post-header">
  <span class="post-label">ai</span>
  <h1 class="post-title">NixOS: the first month in</h1>
  <div class="post-meta">
    <span>19 Aug 2025</span>
    <span class="post-meta-sep">·</span>
    <span>7 min read</span>
    <span class="post-meta-sep">·</span>
    <span>vmargb</span>
  </div>
</header>

<p>
A couple months ago, I put NixOS on my main machine. I want to write down what that's actually been like, not the honeymoon version you see on youtube or read in blog posts from people who just finished setting it up, but where I am after weeks of fighting with it for real work.
</p>

<p>
tldr: it was rougher than what was advertised, the mental model takes real time to build, and there are things that are still genuinely annoying. But the thing it promises which is a declarative and reproducible system that you can actually understand and rebuild from scratch actually delivers.
</p>
<div id="outline-container-orgfaaa382" class="outline-2">
<h2 id="orgfaaa382">What Nix even is</h2>
<div class="outline-text-2" id="text-orgfaaa382">
<p>
If you haven't heard of it, NixOS is a Linux distribution built around the Nix package manager. The core idea is that your entire system configuration, packages, services, users, dotfiles, everything lives in a collection of <code>.nix</code> files(or a single file if you want) that you can commit using version control like Git. Nix being a functional and declarative programming language means whatever you declare, will always reproduce the exact same system, every time.
</p>

<p>
The opposite of this is how most Linux systems work, you install packages imperatively in the terminal over time, modify config files by hand and eventually end up with a system where the current state exists only as a history of commands you may or may not remember entering. The equivalent would be if someone asked for your neovim configuration, and you could only tell them all the settings you "remember" changing/installing.
</p>
</div>
</div>
<div id="outline-container-org2b4afc5" class="outline-2">
<h2 id="org2b4afc5">Month one: I regret everything</h2>
<div class="outline-text-2" id="text-org2b4afc5">
<p>
The first month was genuinely painful. Every minute was wanting to return back to Windows or MacOS.
</p>

<p>
You can't just <code>apt install</code> or <code>brew install</code> something. You can't just download a binary and run it. You can't just follow a tutorial that says "put this in <code>/usr/local/bin</code>." Everything must be declared and configured in a <code>.nix</code>. Everything. The friction is exhausting before it becomes useful.
</p>

<p>
When things work, you don't know why. When things break, you don't know why either. You're just&#x2026; trusting the system which feels like an ominous black-box. Which is the opposite of how most people use Linux. I want to know what's happening. I want to see the files. I want to understand the state of my machine.
</p>

<p>
I also hit the shebang problem that everyone does. You write a script, make it executable, try to run it, and get:
</p>

<blockquote>
<p>
<code>bad interpreter: No such file or directory</code>
</p>
</blockquote>

<p>
Because <code>/usr/bin/python3</code> doesn't exist. Turns out everything is in <code>/nix/store</code> under a unique hash. You learn to use <code>nix-shell</code>. Or you write a derivation. Or you give up and use a wrapper script. None of these feel good on day fifteen when you just want everything to run.
</p>

<blockquote>
<p>
The fastest way through month one: keep search.nixos.org/options and search.nixos.org/packages open in separate tabs. Close them at your own risk. They answer 90% of questions. The other 10% require reading source code(or asking an llm)
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd8383d5" class="outline-2">
<h2 id="orgd8383d5">Flakes (nix in latin means snow btw)</h2>
<div class="outline-text-2" id="text-orgd8383d5">
<p>
The next few weeks in I switched from the traditional <code>configuration.nix</code> setup to flakes. Flakes are technically still "experimental" but in practice everyone in the community uses them. The difference is that flakes give you a locked <code>flake.lock</code> file, similar to how every package manager that handles dependencies work. This is an exact pinned version of every input, including nixpkgs itself. Your system is now fully reproducible not just structurally but in terms of exact package versions.
</p>

<p>
My <code>flake.nix</code> looks roughly like this:
</p>

<div class="org-src-container">
<pre class="src src-nix">{
  description = "my system config";

  inputs = {
    nixpkgs.url = "github:nixos/nixpkgs/nixos-unstable";
    home-manager = {
      url = "github:nix-community/home-manager";
      inputs.nixpkgs.follows = "nixpkgs";
    };
  };

  outputs = { self, nixpkgs, home-manager, ... }: {
    nixosConfigurations.laptop = nixpkgs.lib.nixosSystem {
      system = "x86_64-linux";
      modules = [
        ./hosts/laptop/configuration.nix
        home-manager.nixosModules.home-manager
        { home-manager.users.{user} = import ./home/{user}.nix; }
      ];
    };
  };
}
</pre>
</div>

<p>
The other half of this is Home Manager, which extends the same declarative approach at the system-level to a user-level config dotfiles, shell config, user packages etc. My entire Emacs config, my <code>.zshrc</code>, my git settings, all of it is managed through Home Manager and lives in the same repo as the system config. <code>git clone</code> the repo on a new machine, run <code>nixos-rebuild switch --flake .#laptop</code>, and you have my exact setup.
</p>

<p>
That's not a hypothetical. I tested it. It works.
</p>
</div>
</div>
<div id="outline-container-org3e6d406" class="outline-2">
<h2 id="org3e6d406">The things I actually like now</h2>
<div class="outline-text-2" id="text-org3e6d406">
</div>
<div id="outline-container-org831f572" class="outline-3">
<h3 id="org831f572">Rollbacks</h3>
<div class="outline-text-3" id="text-org831f572">
<p>
If a system rebuild breaks something, you boot into the previous generation from the bootloader menu. This has saved me a couple times, once when the WiFi driver broke, once when I made a bad change to my Niri config and couldn't get a desktop to load. Both times: reboot, select previous generation, rebuild. Now other distros can kind of achieve something similar to this, but none at the sophistication and guarantee of NixOS.
</p>
</div>
</div>
<div id="outline-container-org02a293e" class="outline-3">
<h3 id="org02a293e">Development shells</h3>
<div class="outline-text-3" id="text-org02a293e">
<p>
<code>nix develop</code> and <code>nix-shell</code> let you drop into a shell with exactly the dependencies a project needs, without installing anything globally. You put a <code>shell.nix</code> in most of your project directories. Enter the directory, run <code>nix-shell</code>, and the right version of Python/Node/whatever is available. Leave the directory, it's gone. No annoying virtualenvs, <code>nvm</code> or version conflicts to deal with anymore.
</p>

<div class="org-src-container">
<pre class="src src-nix"># shell.nix for a typical Python project
{ pkgs ? import &lt;nixpkgs&gt; {} }:
pkgs.mkShell {
  buildInputs = with pkgs; [
    python311
    python311Packages.pip
    python311Packages.black
    ruff
    sqlite
  ];
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9514dec" class="outline-3">
<h3 id="org9514dec">The config is the documentation</h3>
<div class="outline-text-3" id="text-org9514dec">
<p>
On previous setups, I had a <code>setup.md</code> file listing things I'd installed, which was perpetually out of date and constantly changing. Now the configuration files themselves <i>are</i> the documentation, they're always accurate because they're declarative and the system handles the rest for me.
</p>
</div>
</div>
</div>
<div id="outline-container-org53544b9" class="outline-2">
<h2 id="org53544b9">The things that are still annoying</h2>
<div class="outline-text-2" id="text-org53544b9">
<p>
Some proprietary software is a pain. Anything that ships its own bundled libraries and expects to find them at standard paths will fail in creative ways. <code>steam-run</code> exists for this, and the nixpkgs Steam package works fine, but if you need to run some random closed-source binary you found somewhere, good luck.
</p>

<p>
The error messages from Nix can be genuinely impenetrable. When something goes wrong in a derivation, you sometimes get a stack trace that requires knowing the internals of the Nix evaluator to parse. This gets better as you learn more but it's not fun at all.
</p>

<p>
Build times. If something isn't cached in the Nix binary cache, it builds from source. Most things are cached. Some things aren't.
</p>

<hr>

<p>
Currently, I think NixOS is worth it for a specific kind of person: someone who finds the "it works on my machine" problem genuinely frustrating. And someone who spends most of their time tinkering and configuring anyway. For that type of person(me), the payoff is real. Your system is recoverable and portable in a way that no other mainstream distro gives you.
</p>


<footer class="post-footer">
  <a href="../blog.html">← back to blog</a>
  <span>Published 19 Aug 2025</span>
</footer>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
